import "./App.css";
import Combobox from "react-widgets/Combobox";
import "react-widgets/styles.css";

function App() {
  return (
    <>
      <h1 className="topic">
        ระบบเสิร์จข้อมูล:
        สำหรับหน่วยรับเรื่องร้องเรียนและสอบถามภายในกรุงเทพมหานคร
      </h1>
      <div className="group-filter">
        <div className="align-left">
          <h1>อยู่ในเขตใด?</h1>
          <Combobox
            defaultValue=""
            placeholder="ค้นหาเขต"
            data={[
              "พระนคร",
              "ดุสิต",
              "หนองจอก",
              "บางรัก",
              "บางเขน",
              "บางกะปิ",
              "ปทุมวัน",
              "ป้อมปราบศัตรูพ่าย",
              "พระโขนง",
              "มีนบุรี",
              "ลาดกระบัง",
              "ยานนาวา",
              "สัมพันธวงศ์",
              "พญาไท",
              "ธนบุรี",
              "บางกอกใหญ่",
              "ห้วยขวาง",
              "คลองสาน",
              "ตลิ่งชัน",
              "บางกอกน้อย",
              "บางขุนเทียน",
              "ภาษีเจริญ",
              "หนองแขม",
              "ราษฎร์บูรณะ",
              "บางพลัด",
              "ดินแดง",
              "บึงกุ่ม",
              "สาทร",
              "บางซื่อ",
              "จตุจักร",
              "บางคอแหลม",
              "ประเวศ",
              "คลองเตย",
              "สวนหลวง",
              "จอมทอง",
              "ดอนเมือง",
              "ราชเทวี",
              "ลาดพร้าว",
              "วัฒนา",
              "บางแค",
              "หลักสี่",
              "สายไหม",
              "คันนายาว",
              "สะพานสูง",
              "วังทองหลาง",
              "คลองสามวา",
              "บางนา",
              "ทวีวัฒนา",
              "ทุ่งครุ",
              "บางบอน",
            ]}
          />
        </div>
        <div className="align-left">
          <h1>อยู่ในแขวงใด?</h1>
          <Combobox
            defaultValue=""
            placeholder="ค้นหาแขวง"
            data={[
              "คลองเตย",
              "คลองตัน",
              "พระโขนง",
              "คลองสาน",
              "คลองต้นไทร",
              "คลองสาน",
              "บางลำภูล่าง",
              "สมเด็จเจ้าพระยา",
              "คลองสามวา",
              "ทรายกองดิน",
              "ทรายกองดินใต้",
              "บางชัน",
              "สามวาตะวันตก",
              "สามวาตะวันออก",
              "คันนายาว",
              "คันนายาว",
              "จตุจักร",
              "จตุจักร",
              "จอมพล",
              "จันทรเกษม",
              "ลาดยาว",
              "เสนานิคม",
              "จอมทอง",
              "จอมทอง",
              "บางขุนเทียน",
              "บางค้อ",
              "บางมด",
              "ดอนเมือง",
              "สีกัน",
              "ดินแดง",
              "ดินแดง",
              "ดุสิต",
              "ดุสิต",
              "ถนนนครไชยศรี",
              "วชิรพยาบาล",
              "สวนจิตรลดา",
              "สี่แยกมหานาค",
              "ตลิ่งชัน",
              "คลองชักพระ",
              "ฉิมพลี",
              "ตลิ่งชัน",
              "บางเชือกหนัง",
              "บางพรม",
              "บางระมาด",
              "ทวีวัฒนา",
              "ทวีวัฒนา",
              "ศาลาธรรมสพน์",
              "ทุ่งครุ",
              "ทุ่งครุ",
              "บางมด",
              "ธนบุรี",
              "ดาวคะนอง",
              "ตลาดพลู",
              "บางยี่เรือ",
              "บุคคโล",
              "วัดกัลยาณ์",
              "สำเหร่",
              "หิรัญรูจี",
              "บางเขน",
              "ท่าแร้ง",
              "อนุสาวรีย์",
              "บางแค",
              "บางแค",
              "บางแคเหนือ",
              "บางไผ่",
              "หลักสอง",
            ]}
          />
        </div>
        <div className="align-left">
          <h1>หน่วยงานใด?</h1>
          <Combobox
            defaultValue=""
            placeholder="ค้นหาหน่วยงาน"
            data={[
              "สำนักงานเขต",
              "สำนักอนามัย",
              "สำนักสิ่งแวดล้อม",
              "สำนักวัฒนธรรม กีฬา และการท่องเที่ยว",
              "สำนักยุทธศาสตร์และประเมินผล",
              "สำนักพัฒนาสังคม",
              "สำนักการวางผังและพัฒนาเมือง",
              "สำนักป้องกันและบรรเทาสาธารณภัย",
              "สำนักงานคณะกรรมการข้าราชการกรุงเทพมหานคร",
              "สำนักงบประมาณกรุงเทพมหานคร",
              "สำนักการศึกษา",
              "สำนักการระบายน้ำ",
              "สำนักการโยธา",
              "สำนักการจราจรและขนส่ง กรุงเทพมหานคร",
              "สำนักปลัดกรุงเทพมหานคร",
              "สำนักเทศกิจ",
              "สำนักงานเลขานุการผู้ว่าราชการกรุงเทพมหานคร",
              "สำนักเลขานุการสภากรุงเทพมหานคร",
              "สำนักการคลัง กรุงเทพมหานคร",
              "สำนักการแพทย์ กรุงเทพมหานคร",
              "สำนักงานกฎหมายและคดี กรุงเทพมหานคร",
              "โรงพยาบาล",
              "การไฟฟ้าและการประปา",
              "ไปรษณีย์",
              "การประปา",
              "ขยะและสิ่งปฏิกูล",
              "ฝ่ายทะเบียน",
              "ฝ่ายปกครอง",
              "ฝ่ายทะเบียน",
              "ฝ่ายโยธา",
              "ฝ่ายสิ่งแวดล้อมและสุขาภิบาล",
              "ฝ่ายรักษาความสะอาดและสวนสาธารณะ",
              "ฝ่ายการศึกษา",
              "ฝ่ายการคลัง",
              "ฝ่ายเทศกิจ",
              "ฝ่ายพัฒนาชุมชนและสวัสดิการสังคม",
              "โรงเรียนประถมศึกษา",
              "โรงเรียนมัธยมศึกษา",
              "ตลาดนัดจตุจักร 2 (มีนบุรี)",
              "บริษัท กรุงเทพธนาคม จำกัด",
              "สำนักงานพัฒนาที่อยู่อาศัย",
              "สำนักงานตลาดกรุงเทพมหานคร",
              "สำนักงานสถานธนานุบาลกรุงเทพมหานคร",
              "วิทยาลัยพยาบาลเกื้อการุณย์",
              "โรงพยาบาลสิรินธร",
              "โรงพยาบาลราชพิพัฒน์",
              "โรงพยาบาลลาดกระบัง",
              "โรงพยาบาลเวชการุณย์รัศมิ์",
              "โรงพยาบาลหลวงพ่อทวีศักดิ์",
              "โรงพยาบาลเจริญกรุงประชารักษ์",
              "โรงพยาบาลตากสิน",
              "โรงพยาบาลกลาง",
              "ศูนย์ข้อมูลเศรษฐกิจการคลัง",
              "กองการต่างประเทศ",
              "กองประชาสัมพันธ์ กรุงเทพมหานคร",
              "สภาร่างรัฐธรรมนูญ",
              "กองการท่องเที่ยวกรุงเทพมหานคร",
              "สำนักงานตำรวจแห่งชาติ",
              "สำนักงานปลัดสำนักนายกรัฐมนตรี",
              "ศูนย์ กทม. 1555",
              "ระบบ e-Auction",
              "ข่าวสารราชกิจจานุเบกษา",
              "GIS Online",
              "ศูนย์ข้อมูลกรุงเทพมหานคร",
            ]}
          />
        </div>
        <div className="align-left">
          <h1>ข้อมูลประเภทใด?</h1>
          <Combobox
            defaultValue=""
            placeholder="ค้นหาประเภทข้อมูล"
            data={[
              "ข้อมูลทั่วไป",
              "เบอร์โทรศัพท์",
              "ที่อยู่",
              "สอบถามบริการ",
              "หน้าที่และความรับผิดชอบของหน่วยงาน",
            ]}
          />
        </div>
        <div className="align-left">
          <h1>ประชาชนจะทำอะไร?</h1>
          <Combobox
            defaultValue=""
            placeholder="ค้นหากิจกรรม"
            data={[
              "ทำบัตรประชาชน",
              "บัตรประชาชน",
              "ทำบัตรทอง",
              "บัตรทอง",
              "จดทะเบียนสมรส",
            ]}
          />
        </div>
        <div className="align-left">
          <h1>ค้นหาจากคีย์เวิร์ด</h1>
          <Combobox
            defaultValue=""
            placeholder="ค้นหาจากคีย์เวิร์ด"
            data={[""]}
          />
        </div>
      </div>
    </>
  );
}

export default App;
